# brew for regular Homebrew command-line apps
# cask for desktop applications
# mas for Apple App Store applications

# Taps
# 'brew tap'
tap 'homebrew/cask'
tap 'homebrew/cask-fonts'
# tap 'homebrew/cask-versions'
tap 'homebrew/bundle'

# Binaries
# 'brew install'
brew 'awscli'
brew 'bash' # Latest Bash version
brew 'coreutils' # Those that come with macOS are outdated
brew 'doctl'
brew 'ffmpeg'
brew 'gh'
brew 'git'
brew 'gnupg'
brew 'grep'
brew 'kubectl'
brew 'mackup'
brew 'mas' # Mac App Store manager
brew 'tree' # List directories in a tree structure
brew 'zsh-autosuggestions'

# Development
brew 'node'

# Apps
# 'brew install --cask'
cask 'google-cloud-sdk'
# cask '1password'
cask '1password-cli'
cask 'aerial'
# cask 'dbngin'
# cask 'discord'
# cask 'docker'
# cask 'firefox'
# cask 'google-chrome'
# cask 'gpg-suite'
cask 'imageoptim'
# cask 'insomnia'
# cask 'pastebot'
# cask 'signal'
# cask 'slack'
# cask 'tableplus'
# cask 'tower'
# cask 'telegram-desktop'
# cask 'the-unarchiver'
# cask 'transmit'
# cask 'visual-studio-code'
# cask 'zoom'

# Fonts
# cask 'font-lato'
# cask 'font-open-sans'
# cask 'font-roboto'

# Mac App Store
# 'mas install'
# mas 'Things', id: 904280696
# mas "1Password", id: 443987910

# 'whalebrew install'
# whalebrew "whalebrew/wget"